{
  "name":"annual-consumer-price-index-by-country",
  "title":"Annual Consumer Price Index by Country",
  "description":"This dataset contains a list of Annual Consumer Price Index (CPI) values for countries for the years 1960-2021. It comprises the Country Name, Country Code and the CPI values for several countries.",
  "documentation":"This dataset is sourced from The World Bank. It includes different country names and codes, indicator names and codes and their Annual Consumer Price Index (CPI) for the period 1960-2021. Year 2010 CPI has been taken as the reference (meaning the value of CPI for all countries is 100 and all other CPI values are relative to year 2010). In this dataset the CPI Indicator is FP.CPI.TOTL for all the countries.\n\nA CPI measures changes in the price level of market basket of consumer goods and services purchased by households. The CPI is a statistical estimate constructed using the prices of a sample of representative items whose prices are collected periodically. Sub-indices and sub-sub-indices are computed for different categories and sub-categories of goods and services, being combined to produce the overall index with weights reflecting their shares in the total of the consumer expenditures covered by the index. It is one of several price indices calculated by most national statistical agencies. The annual percentage change in a CPI is used as a measure of inflation. A CPI can be used to index (i.e., adjust for the effect of inflation) the real value of wages, salaries, pensions, for regulating prices and for deflating monetary magnitudes to show changes in real values. In most countries, the CPI, along with the population census, is one of the most closely watched national economic statistics.\n\nCPI is usually computed monthly, or quarterly in some countries, as a weighted average of sub-indices for different components of consumer expenditure, such as food, housing, shoes and clothing, each of which is in turn a weighted average of sub-sub-indices. CPI is very simple to calculate. The current CPI can be easily calculated when the \"updated cost\" (i.e. the price of an item at a given year, e.g.: the price of bread in 2021) is divided by that of the initial year (the price of bread in 2010), then multiplied by one hundred.",
  "date_created":"2017-07-20",
  "last_updated":"2022-06-30",
  "version":"2022-06-30",
  "update_frequency":"Annual",
  "temporal_coverage":"1960-2021",
  "spatial_coverage":"N/A",
  "complexity":"Simple",
  "license":"John Snow Labs Standard License",
  "sources":[
    {
      "title":"John Snow Labs"
    },
    {
      "title":"The World Bank"
    }
  ],
  "contributors":[
    {
      "title":"John Snow Labs",
      "email":"support@JohnSnowLabs.com",
      "uri":"http://www.JohnSnowLabs.com",
      "role":"author"
    }
  ],
  "source_license_requirements":"N/A",
  "citation":"N/A",
  "keywords":[
    "Consumer Price Index",
    "Market Price Level",
    "Calculating CPI"
  ],
  "other_titles":[
    "Annual Consumer Price Indices for Different Countries",
    "Annual CPI Around the World from 1960-2021"
  ],
  "resources":[
    {
      "path":"data.csv",
      "name":"annual-consumer-price-index-by-country-csv",
      "format":"csv",
      "mediatype":"text/csv",
      "schema":{
        "fields":[
          {
            "name":"Country",
            "description":"Refers to the Name of the Country for which the Annual Consumer Price Index (CPI) is calculated.",
            "type":"string",
            "constraints":{
              "required":true
            }
          },
          {
            "name":"Country_Code",
            "description":"Indicates the Codes for different countries.",
            "type":"string",
            "constraints":{
              "required":true
            }
          },
          {
            "name":"Year",
            "description":"The CPI value for year 1960-2021 for different countries.",
            "type":"date",
            "format":"any"
          },
          {
            "name":"CPI",
            "description":"Indicates the Consumer Price Index (CPI) for different countries. CPI (where 2005=100), where 2005 is treated as base period.",
            "type":"number",
            "constraints":{
              "level":"Ratio"
            }
          }
        ]
      }
    }
  ]
}